<?php
    function createQuestions(){
    $questions = [];

    $myobj = new Question('В какой команде играет Месси?',5,['a' => 'Барселона', 'b' => 'Бавария', 'c' => 'Манчестер Сити', 'd' => 'ПСЖ'],'a');
    $questions[] = $myobj;

    $myobj = new Question('Сколько золотых мячей у Месси?',10,['a' => 'один', 'b' => 'три', 'с'=>'пять', 'd'=>'шесть'],'c');
    $questions[] = $myobj;

    $myobj = new Question('В финале какого турнира не играл Месси?',15,['a'=>'в финале ЛЧ', 'b' => 'в финале КОНМЕБОЛ', 'c'=>'в финале кубка Испании','d'=>'в финале ЧЕ'],'d');
    $questions[] = $myobj;

    return $questions; // Возвращаем массив
    }
?>
